---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsActualTreadDepthLessThanMinimumFailure
source: html/f9b8ba3a-07cb-560d-89f4-f0a465e27d6a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsActualTreadDepthLessThanMinimumFailure Property

Computed actual tread depth of stairs is less than minimum tread depth defined in stairs type.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsActualTreadDepthLessThanMinimumFailure { get; }
```